pikasTech/PikaPython/packages/machine/STM32/pika_hal_stm32_UART.c
static struct stm32_uart uart_obj[sizeof(uart_config) / sizeof(uart_config[0])] = {0};

static rt_uint32_t stm32_uart_get_mask(rt_uint32_t word_length, rt_uint32_t parity)
{
    rt_uint32_t mask = 0x00FFU;
    if (word_length == UART_WORDLENGTH_8B)
    {
        if (parity == UART_PARITY_NONE)
        {
            mask = 0x00FFU ;
        }
        else
        {
            mask = 0x007FU ;
        }
    }
#ifdef UART_WORDLENGTH_9B
    else if (word_length == UART_WORDLENGTH_9B)
    {
        if (parity == UART_PARITY_NONE)
        {
            mask = 0x01FFU ;
        }
        else
        {
            mask = 0x00FFU ;
        }
    }
#endif
#ifdef UART_WORDLENGTH_7B
    else if (word_length == UART_WORDLENGTH_7B)
    {
        if (parity == UART_PARITY_NONE)
        {
            mask = 0x007FU ;
        }
        else
        {
            mask = 0x003FU ;
        }
    }
    else
    {
        mask = 0x0000U;
    }
#endif
    return mask;
}

static rt_err_t stm32_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct stm32_uart *uart;
    int uart_unit;
    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

    uart = rt_container_of(serial, struct stm32_uart, serial);
    uart->handle.Instance          = uart->config->Instance;
    uart->handle.Init.BaudRate     = cfg->baud_rate;
    uart->handle.Init.Mode         = UART_MODE_TX_RX;
#ifdef USART_CR1_OVER8
    uart->handle.Init.OverSampling = cfg->baud_rate > 5000000 ? UART_OVERSAMPLING_8 : UART_OVERSAMPLING_16;
#else
    uart->handle.Init.OverSampling = UART_OVERSAMPLING_16;
#endif /* USART_CR1_OVER8 */

    switch (cfg->flowcontrol)
    {
    case RT_SERIAL_FLOWCONTROL_NONE:
        uart->handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
        break;
    case RT_SERIAL_FLOWCONTROL_CTSRTS:
        uart->handle.Init.HwFlowCtl = UART_HWCONTROL_RTS_CTS;
        break;
    default:
        uart->handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
        break;
    }

    switch (cfg->data_bits)
    {
    case DATA_BITS_8:
        if (cfg->parity == PARITY_ODD || cfg->parity == PARITY_EVEN)
            uart->handle.Init.WordLength = UART_WORDLENGTH_9B;
        else
            uart->handle.Init.WordLength = UART_WORDLENGTH_8B;
        break;
    case DATA_BITS_9:
        uart->handle.Init.WordLength = UART_WORDLENGTH_9B;
        break;
    default:
        uart->handle.Init.WordLength = UART_WORDLENGTH_8B;
        break;
    }

    switch (cfg->stop_bits)
    {
    case STOP_BITS_1:
        uart->handle.Init.StopBits   = UART_STOPBITS_1;
        break;
    case STOP_BITS_2:
        uart->handle.Init.StopBits   = UART_STOPBITS_2;
        break;
    default:
        uart->handle.Init.StopBits   = UART_STOPBITS_1;
        break;
    }

    switch (cfg->parity)
    {
    case PARITY_NONE:
        uart->handle.Init.Parity     = UART_PARITY_NONE;
        break;
    case PARITY_ODD:
        uart->handle.Init.Parity     = UART_PARITY_ODD;
        break;
    case PARITY_EVEN:
        uart->handle.Init.Parity     = UART_PARITY_EVEN;
        break;
    default:
        uart->handle.Init.Parity     = UART_PARITY_NONE;
        break;
    }

#ifdef RT_SERIAL_USING_DMA
    if (!(serial->parent.open_flag & RT_DEVICE_OFLAG_OPEN)) {
        uart->dma_rx.remaining_cnt = cfg->bufsz;
    }
#endif

#ifdef USART1
    if (uart->handle.Instance == USART1){
        __HAL_RCC_USART1_CLK_ENABLE();
        uart_unit = 1;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_9;
            uart->config->GPIO_TX_Port = GPIOA;
            uart->config->GPIO_RX_Pin = GPIO_PIN_10;
            uart->config->GPIO_RX_Port = GPIOA;
            pika_platform_printf("WARNING: UART1 GPIO TX/RX Pin not set, use default PA9/PA10\r\n");
        }
    }
#endif

#ifdef USART2
    if (uart->handle.Instance == USART2){
        __HAL_RCC_USART2_CLK_ENABLE();
        uart_unit = 2;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_2;
            uart->config->GPIO_TX_Port = GPIOA;
            uart->config->GPIO_RX_Pin = GPIO_PIN_3;
            uart->config->GPIO_RX_Port = GPIOA;
            pika_platform_printf("WARNING: UART2 GPIO TX/RX Pin not set, use default PA2/PA3\r\n");
        }
    }
#endif

#ifdef USART3
    if (uart->handle.Instance == USART3){
        __HAL_RCC_USART3_CLK_ENABLE();
        uart_unit = 3;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_10;
            uart->config->GPIO_TX_Port = GPIOB;
            uart->config->GPIO_RX_Pin = GPIO_PIN_11;
            uart->config->GPIO_RX_Port = GPIOB;
            pika_platform_printf("WARNING: UART3 GPIO TX/RX Pin not set, use default PB10/PB11\r\n");
        }
    }
#endif

#ifdef UART4
    if (uart->handle.Instance == UART4){
        __HAL_RCC_UART4_CLK_ENABLE();
        uart_unit = 4;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_0;
            uart->config->GPIO_TX_Port = GPIOA;
            uart->config->GPIO_RX_Pin = GPIO_PIN_1;
            uart->config->GPIO_RX_Port = GPIOA;
            pika_platform_printf("WARNING: UART4 GPIO TX/RX Pin not set, use default PA0/PA1\r\n");
        }
    }
#endif

#ifdef USART4
    if (uart->handle.Instance == USART4){
        __HAL_RCC_USART4_CLK_ENABLE();    
        uart_unit = 4;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_0;
            uart->config->GPIO_TX_Port = GPIOA;
            uart->config->GPIO_RX_Pin = GPIO_PIN_1;
            uart->config->GPIO_RX_Port = GPIOA;
            pika_platform_printf("WARNING: UART4 GPIO TX/RX Pin not set, use default PA0/PA1\r\n");
        }
    }
#endif

#ifdef UART5
    if (uart->handle.Instance == UART5){
        __HAL_RCC_UART5_CLK_ENABLE();
        uart_unit = 5;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_12;
            uart->config->GPIO_TX_Port = GPIOC;
            uart->config->GPIO_RX_Pin = GPIO_PIN_2;
            uart->config->GPIO_RX_Port = GPIOD;
            pika_platform_printf("WARNING: UART5 GPIO TX/RX Pin not set, use default PC12/PD2\r\n");
        }
    }
#endif

