pikasTech/PikaPython/packages/machine/STM32/pika_hal_stm32_UART.c
#ifdef USART5
    if (uart->handle.Instance == USART5){
        __HAL_RCC_USART5_CLK_ENABLE();  
        uart_unit = 5;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_12;
            uart->config->GPIO_TX_Port = GPIOC;
            uart->config->GPIO_RX_Pin = GPIO_PIN_2;
            uart->config->GPIO_RX_Port = GPIOD;
            pika_platform_printf("WARNING: UART5 GPIO TX/RX Pin not set, use default PC12/PD2\r\n");
        }
    }
#endif

#ifdef UART6
    if (uart->handle.Instance == UART6){
        __HAL_RCC_UART6_CLK_ENABLE();  
        uart_unit = 6;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_6;
            uart->config->GPIO_TX_Port = GPIOC;
            uart->config->GPIO_RX_Pin = GPIO_PIN_7;
            uart->config->GPIO_RX_Port = GPIOC;
            pika_platform_printf("WARNING: UART6 GPIO TX/RX Pin not set, use default PC6/PC7\r\n");
        }
    }
#endif

#ifdef USART6
    if (uart->handle.Instance == USART6){
        __HAL_RCC_USART6_CLK_ENABLE();   
        uart_unit = 6;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_6;
            uart->config->GPIO_TX_Port = GPIOC;
            uart->config->GPIO_RX_Pin = GPIO_PIN_7;
            uart->config->GPIO_RX_Port = GPIOC;
            pika_platform_printf("WARNING: UART6 GPIO TX/RX Pin not set, use default PC6/PC7\r\n");
        }
    }
#endif

#ifdef UART7
    if (uart->handle.Instance == UART7){
        __HAL_RCC_UART7_CLK_ENABLE();    
        uart_unit = 7;
        if (0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_1;
            uart->config->GPIO_TX_Port = GPIOE;
            uart->config->GPIO_RX_Pin = GPIO_PIN_0;
            uart->config->GPIO_RX_Port = GPIOE;
            pika_platform_printf("WARNING: UART7 GPIO TX/RX Pin not set, use default PE1/PE0\r\n");
        }
    }
#endif

#ifdef USART7
    if (uart->handle.Instance == USART7){
        __HAL_RCC_USART7_CLK_ENABLE();    
        uart_unit = 7;
        if(0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_1;
            uart->config->GPIO_TX_Port = GPIOE;
            uart->config->GPIO_RX_Pin = GPIO_PIN_0;
            uart->config->GPIO_RX_Port = GPIOE;
            pika_platform_printf("WARNING: UART7 GPIO TX/RX Pin not set, use default PE1/PE0\r\n");
        }
    }
#endif

#ifdef UART8
    if (uart->handle.Instance == UART8){
        __HAL_RCC_UART8_CLK_ENABLE();   
        uart_unit = 8;
        if(0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_1;
            uart->config->GPIO_TX_Port = GPIOE;
            uart->config->GPIO_RX_Pin = GPIO_PIN_0;
            uart->config->GPIO_RX_Port = GPIOE;
            pika_platform_printf("WARNING: UART8 GPIO TX/RX Pin not set, use default PE1/PE0\r\n");
        }
    }
#endif

#ifdef USART8
    if (uart->handle.Instance == USART8){
        __HAL_RCC_USART8_CLK_ENABLE();    
        uart_unit = 8;
        if(0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_1;
            uart->config->GPIO_TX_Port = GPIOE;
            uart->config->GPIO_RX_Pin = GPIO_PIN_0;
            uart->config->GPIO_RX_Port = GPIOE;
            pika_platform_printf("WARNING: UART8 GPIO TX/RX Pin not set, use default PE1/PE0\r\n");
        }
    }
#endif

#ifdef UART9
    if (uart->handle.Instance == UART9){
        __HAL_RCC_UART9_CLK_ENABLE(); 
        uart_unit = 9;
        if(0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_1;
            uart->config->GPIO_TX_Port = GPIOE;
            uart->config->GPIO_RX_Pin = GPIO_PIN_0;
            uart->config->GPIO_RX_Port = GPIOE;
            pika_platform_printf("WARNING: UART9 GPIO TX/RX Pin not set, use default PE1/PE0\r\n");
        }
    }
#endif

#ifdef USART9
    if (uart->handle.Instance == USART9){
        __HAL_RCC_USART9_CLK_ENABLE();    
        uart_unit = 9;
        if(0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_1;
            uart->config->GPIO_TX_Port = GPIOE;
            uart->config->GPIO_RX_Pin = GPIO_PIN_0;
            uart->config->GPIO_RX_Port = GPIOE;
            pika_platform_printf("WARNING: UART9 GPIO TX/RX Pin not set, use default PE1/PE0\r\n");
        }
    }
#endif

#ifdef UART10
    if (uart->handle.Instance == UART10){
        __HAL_RCC_UART10_CLK_ENABLE();  
        uart_unit = 10;
        if(0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_1;
            uart->config->GPIO_TX_Port = GPIOE;
            uart->config->GPIO_RX_Pin = GPIO_PIN_0;
            uart->config->GPIO_RX_Port = GPIOE;
            pika_platform_printf("WARNING: UART10 GPIO TX/RX Pin not set, use default PE1/PE0\r\n");
        }
    }
#endif

#ifdef USART10
    if (uart->handle.Instance == USART10){
        __HAL_RCC_USART10_CLK_ENABLE();    
        uart_unit = 10;
        if(0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_1;
            uart->config->GPIO_TX_Port = GPIOE;
            uart->config->GPIO_RX_Pin = GPIO_PIN_0;
            uart->config->GPIO_RX_Port = GPIOE;
            pika_platform_printf("WARNING: UART10 GPIO TX/RX Pin not set, use default PE1/PE0\r\n");
        }
    }
#endif

#ifdef LPUART1
    if (uart->handle.Instance == LPUART1){
        __HAL_RCC_LPUART1_CLK_ENABLE();
        uart_unit = 1;
        if(0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_2;
            uart->config->GPIO_TX_Port = GPIOA;
            uart->config->GPIO_RX_Pin = GPIO_PIN_3;
            uart->config->GPIO_RX_Port = GPIOA;
            pika_platform_printf("WARNING: LPUART1 GPIO TX/RX Pin not set, use default PA2/PA3\r\n");
        }
    }
#endif

#ifdef LPUART2
    if (uart->handle.Instance == LPUART2){
        __HAL_RCC_LPUART2_CLK_ENABLE();    
        uart_unit = 2;
        if(0 == uart->config->GPIO_TX_Pin && 0 == uart->config->GPIO_RX_Pin){
            uart->config->GPIO_TX_Pin = GPIO_PIN_2;
            uart->config->GPIO_TX_Port = GPIOA;
            uart->config->GPIO_RX_Pin = GPIO_PIN_3;
            uart->config->GPIO_RX_Port = GPIOA;
            pika_platform_printf("WARNING: LPUART2 GPIO TX/RX Pin not set, use default PA2/PA3\r\n");
        }
    }
#endif
    
