pikasTech/PikaPython/packages/machine/STM32/pika_hal_stm32_UART.c
    device->type        = RT_Device_Class_Char;
    device->rx_indicate = RT_NULL;
    device->tx_complete = RT_NULL;

#ifdef RT_USING_DEVICE_OPS
    // device->ops         = &serial_ops;
    device->ops         = NULL;
#else
    device->init        = rt_serial_init;
    device->open        = rt_serial_open;
    device->close       = rt_serial_close;
    device->read        = rt_serial_read;
    device->write       = rt_serial_write;
    device->control     = rt_serial_control;
#endif
    device->user_data   = data;

    /* register a character device */
    // ret = rt_device_register(device, name, flag);

#ifdef RT_USING_POSIX_STDIO
    /* set fops */
    device->fops        = &_serial_fops;
#endif

    return RT_EOK;
}

/* Default config for serial_configure structure */
#define RT_SERIAL_CONFIG_DEFAULT           \
{                                          \
    BAUD_RATE_115200, /* 115200 bits/s */  \
    DATA_BITS_8,      /* 8 databits */     \
    STOP_BITS_1,      /* 1 stopbit */      \
    PARITY_NONE,      /* No parity  */     \
    BIT_ORDER_LSB,    /* LSB first sent */ \
    NRZ_NORMAL,       /* Normal mode */    \
    RT_SERIAL_RB_BUFSZ, /* Buffer size */  \
    RT_SERIAL_FLOWCONTROL_NONE, /* Off flowcontrol */ \
    0                                      \
}

static void uart_clock_init(void){
#if defined(STM32H7)
    RCC_PeriphCLKInitTypeDef RCC_PeriphClkInit = {0};
    // Configure USART1/6 and USART2/3/4/5/7/8 clock sources
    RCC_PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART16 | RCC_PERIPHCLK_USART234578;
    RCC_PeriphClkInit.Usart16ClockSelection = RCC_USART16CLKSOURCE_D2PCLK2;
    RCC_PeriphClkInit.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_D2PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphClkInit) != HAL_OK) {
        pika_platform_printf("Error at HAL_RCCEx_PeriphCLKConfig\r\n");
    }
#endif
}

static int pika_hal_stricmp(const char *s1, const char *s2) {
    while (*s1 && *s2) {
        int diff = tolower((unsigned char)*s1) - tolower((unsigned char)*s2);
        if (diff != 0) {
            return diff;
        }
        s1++;
        s2++;
    }
    return tolower((unsigned char)*s1) - tolower((unsigned char)*s2);
}

static volatile int uart_inited = 0;
static int rt_hw_usart_init(void)
{
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;
    rt_err_t result = 0;
    
    uart_clock_init();

    stm32_uart_get_dma_config();

    for (rt_size_t i = 0; i < sizeof(uart_obj) / sizeof(struct stm32_uart); i++)
    {
        /* init UART object */
        uart_obj[i].config = &uart_config[i];
        uart_obj[i].serial.ops    = &stm32_uart_ops;
        uart_obj[i].serial.config = config;

        /* register UART device */
        result = rt_hw_serial_register(&uart_obj[i].serial, uart_obj[i].config->name,
                                       RT_DEVICE_FLAG_RDWR
                                       | RT_DEVICE_FLAG_INT_RX
                                       | RT_DEVICE_FLAG_INT_TX
                                       | uart_obj[i].uart_dma_flag
                                       , NULL);
        RT_ASSERT(result == RT_EOK);
    }

    return result;
}

#define RX_BUFF_LENGTH 256
typedef struct platform_UART {
    struct stm32_uart* rt_uart;
    struct serial_configure config;
    uint8_t rxBuff[RX_BUFF_LENGTH];
    size_t writePointer;
    size_t readPointer;
} platform_UART;

int pika_hal_platform_UART_open(pika_dev* dev, char* name) {
    if (uart_inited == 0){
        rt_hw_usart_init();
        uart_inited = 1;
    }
    for (rt_size_t i = 0; i < sizeof(uart_obj) / sizeof(struct stm32_uart); i++){
        if (0 == pika_hal_stricmp(name, uart_obj[i].config->name)){
            platform_UART* uart = (platform_UART*)pikaMalloc(sizeof(platform_UART));
            pika_platform_memset(uart, 0, sizeof(platform_UART));
            if (NULL == uart){
                return -1;
            }
            uart->rt_uart = &uart_obj[i];
            uart->rt_uart->user_data = dev;
            dev->platform_data = uart;
            return 0;
        }
    }
    pika_platform_printf("Error: UART %s not found\r\n", name);
    pika_platform_printf("Available UARTs:\r\n");
    for (rt_size_t i = 0; i < sizeof(uart_obj) / sizeof(struct stm32_uart); i++){
        pika_platform_printf("'%s'\r\n", uart_obj[i].config->name);
    }
    return -1;
}

int pika_hal_platform_UART_close(pika_dev* dev) {
    platform_UART* uart = (platform_UART*)dev->platform_data;
    if(NULL != uart){
        pikaFree(uart, sizeof(platform_UART));
    }
    return 0;
}

int pika_hal_platform_UART_ioctl_config(pika_dev* dev,
                                        pika_hal_UART_config* cfg) {
    platform_UART* uart = (platform_UART*)dev->platform_data;
    if( !dev->is_enabled ){
        const struct serial_configure default_config = RT_SERIAL_CONFIG_DEFAULT;
        pika_platform_memcpy(&uart->config, &default_config, sizeof(struct serial_configure));
        switch(cfg->data_bits){
            case PIKA_HAL_UART_DATA_BITS_8:
                uart->config.data_bits = DATA_BITS_8;
                break;
            case PIKA_HAL_UART_DATA_BITS_7:
                uart->config.data_bits = DATA_BITS_7;
                break;
            case PIKA_HAL_UART_DATA_BITS_6:
                uart->config.data_bits = DATA_BITS_6;
                break;
            case PIKA_HAL_UART_DATA_BITS_5:
                uart->config.data_bits = DATA_BITS_5;
                break;
            default:
                pika_platform_printf("Error: invalid data bits %d\r\n", cfg->data_bits);
                return -1;
        }
        switch(cfg->flow_control){
            case PIKA_HAL_UART_FLOW_CONTROL_NONE:
                uart->config.flowcontrol = RT_SERIAL_FLOWCONTROL_NONE;
                break;
            case PIKA_HAL_UART_FLOW_CONTROL_RTS_CTS:
                uart->config.flowcontrol = RT_SERIAL_FLOWCONTROL_CTSRTS;
                break;
            default:
                pika_platform_printf("Error: invalid flow control %d\r\n", cfg->flow_control);
                return -1;
        }
        switch(cfg->parity){
            case PIKA_HAL_UART_PARITY_NONE:
                uart->config.parity = PARITY_NONE;
                break;
            case PIKA_HAL_UART_PARITY_EVEN:
                uart->config.parity = PARITY_EVEN;
                break;
            case PIKA_HAL_UART_PARITY_ODD:
                uart->config.parity = PARITY_ODD;
                break;
            default:
                pika_platform_printf("Error: invalid parity %d\r\n", cfg->parity);
                return -1;
        }
        switch(cfg->stop_bits){
            case PIKA_HAL_UART_STOP_BITS_1:
                uart->config.stop_bits = STOP_BITS_1;
                break;
            case PIKA_HAL_UART_STOP_BITS_2:
                uart->config.stop_bits = STOP_BITS_2;
                break;
            default:
                pika_platform_printf("Error: invalid stop bits %d\r\n", cfg->stop_bits);
                return -1;
        }
        uart->config.baud_rate = cfg->baudrate;
        return 0;
    }
    /* unsupported */
    return -1;
}

int pika_hal_platform_UART_ioctl_enable(pika_dev* dev) {
    platform_UART* uart = (platform_UART*)dev->platform_data;
    stm32_configure(&uart->rt_uart->serial, &uart->config);
    stm32_control(&uart->rt_uart->serial, RT_DEVICE_CTRL_SET_INT, NULL);
    HAL_UART_Receive_IT(&uart->rt_uart->handle, uart->rxBuff, 1);
    return 0;
}

int pika_hal_platform_UART_ioctl_disable(pika_dev* dev) {
    return -1;
}

