pikasTech/PikaPython/packages/machine/STM32/pika_hal_stm32_UART.c
static pika_dev* find_uart_from_handle(UART_HandleTypeDef* handle){
    for (rt_size_t i = 0; i < sizeof(uart_obj) / sizeof(struct stm32_uart); i++){
        if (handle == &uart_obj[i].handle){
            return uart_obj[i].user_data;
        }
    }
    return NULL;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef* huart) {
    pika_dev* uart = find_uart_from_handle(huart);
    platform_UART* pika_uart = uart->platform_data;

    // Increment writePointer, wrap around if needed
    pika_uart->writePointer = (pika_uart->writePointer + 1) % RX_BUFF_LENGTH;

    // Start receiving next character
    UART_Start_Receive_IT(huart, (uint8_t*)(pika_uart->rxBuff + pika_uart->writePointer), 1);
}

int pika_hal_platform_UART_read(pika_dev* dev, void* buf, size_t count) {
    platform_UART* pika_uart = (platform_UART*)dev->platform_data;
    size_t dataAvailable = (pika_uart->writePointer + RX_BUFF_LENGTH - pika_uart->readPointer) % RX_BUFF_LENGTH;

    size_t length = count < dataAvailable ? count : dataAvailable;

    for (size_t i = 0; i < length; i++) {
        ((char*)buf)[i] = pika_uart->rxBuff[pika_uart->readPointer];
        pika_uart->readPointer = (pika_uart->readPointer + 1) % RX_BUFF_LENGTH;
    }

    UART_Start_Receive_IT(&pika_uart->rt_uart->handle, (uint8_t*)(pika_uart->rxBuff + pika_uart->writePointer), 1);

    return length;
}

int pika_hal_platform_UART_write(pika_dev* dev, void* buf, size_t count) {
    platform_UART* uart = (platform_UART*)dev->platform_data;
    HAL_UART_Transmit(&uart->rt_uart->handle, buf, count, 0xffff);
    return 0;
}

// #endif /* RT_USING_SERIAL */
